webroot/001-1G_LowFareSearchReq.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header/>
  <soapenv:Body>
    <air:LowFareSearchReq xmlns:air="http://www.travelport.com/schema/air_v42_0" TraceId="trace" AuthorizedBy="user" TargetBranch="P7116701" SolutionResult="true">
      <com:BillingPointOfSaleInfo xmlns:com="http://www.travelport.com/schema/common_v42_0" OriginApplication="UAPI"/>
      <air:SearchAirLeg>
        <air:SearchOrigin>
          <com:Airport xmlns:com="http://www.travelport.com/schema/common_v42_0" Code="LAD"/>
        </air:SearchOrigin>
        <air:SearchDestination>
          <com:Airport xmlns:com="http://www.travelport.com/schema/common_v42_0" Code="JFK"/>
        </air:SearchDestination>
        <air:SearchDepTime PreferredTime="2019-05-25"/>
      </air:SearchAirLeg>
      <air:SearchAirLeg>
        <air:SearchOrigin>
          <com:Airport xmlns:com="http://www.travelport.com/schema/common_v42_0" Code="JFK"/>
        </air:SearchOrigin>
        <air:SearchDestination>
          <com:Airport xmlns:com="http://www.travelport.com/schema/common_v42_0" Code="LAD"/>
        </air:SearchDestination>
        <air:SearchDepTime PreferredTime="2019-06-01"/>
      </air:SearchAirLeg>
      <air:AirSearchModifiers>
        <air:PreferredProviders>
          <com:Provider xmlns:com="http://www.travelport.com/schema/common_v42_0" Code="1G"/>
        </air:PreferredProviders>
        <air:PermittedCabins>
          <com:CabinClass xmlns:com="http://www.travelport.com/schema/common_v42_0" Type="Economy"/>
        </air:PermittedCabins>
      </air:AirSearchModifiers>
      <com:SearchPassenger xmlns:com="http://www.travelport.com/schema/common_v42_0" BookingTravelerRef="0" Code="ADT"/>
    </air:LowFareSearchReq>
  </soapenv:Body>
</soapenv:Envelope>
